tests/cases/runnerTemperature/system/expectedPatterns
moldingFoam: read .*moldingDict
End
