tests/cases/runnerTemperature/system/verifyScript
verify-runner-temperature.py
